interface BaseMessage {
  isMine: boolean;
  time: string;
  message: string;
}

interface MyMessage extends BaseMessage {
  isMine: true;
  isRead: boolean;
}

interface NotMyMessage extends BaseMessage {
  isMine: false;
}

type Message = MyMessage | NotMyMessage;

export interface ConversationDay {
  date: string;
  messages: Message[];
}

export const mockContact = {
  contact: {
    avatar: null,
    displayName: 'Кто-то',
  },
  conversation: [
    {
      date: '18 июня',
      messages: [
        {
          isMine: false,
          time: '11:56',
          message:
            'Привет! Смотри, тут всплыл интересный кусок лунной космической истории — НАСА в какой-то момент попросила Хассельблад адаптировать модель SWC для полетов на Луну. Сейчас мы все знаем что астронавты летали с моделью 500 EL — и к слову говоря, все тушки этих камер все еще находятся на поверхности Луны, так как астронавты с собой забрали только кассеты с пленкой. Хассельблад в итоге адаптировал SWC для космоса, но что-то пошло не так и на ракету они так никогда и не попали. Всего их было произведено 25 штук, одну из них недавно продали на аукционе за 45000 евро.',
        },
        {
          isMine: true,
          time: '12:00',
          isRead: true,
          message: 'Круто!',
        },
      ],
    },
    {
      date: '19 июня',
      messages: [
        {
          isMine: false,
          time: '11:56',
          message: 'Круто!',
        },
        {
          isMine: true,
          time: '12:00',
          isRead: true,
          message:
            'Привет! Смотри, тут всплыл интересный кусок лунной космической истории — НАСА в какой-то момент попросила Хассельблад адаптировать модель SWC для полетов на Луну. Сейчас мы все знаем что астронавты летали с моделью 500 EL — и к слову говоря, все тушки этих камер все еще находятся на поверхности Луны, так как астронавты с собой забрали только кассеты с пленкой. Хассельблад в итоге адаптировал SWC для космоса, но что-то пошло не так и на ракету они так никогда и не попали. Всего их было произведено 25 штук, одну из них недавно продали на аукционе за 45000 евро.',
        },
      ],
    },
    {
      date: '20 июня',
      messages: [
        {
          isMine: false,
          time: '11:56',
          message: 'Круто!',
        },
        {
          isMine: true,
          time: '12:00',
          isRead: true,
          message:
            'Привет! Смотри, тут всплыл интересный кусок лунной космической истории — НАСА в какой-то момент попросила Хассельблад адаптировать модель SWC для полетов на Луну. Сейчас мы все знаем что астронавты летали с моделью 500 EL — и к слову говоря, все тушки этих камер все еще находятся на поверхности Луны, так как астронавты с собой забрали только кассеты с пленкой. Хассельблад в итоге адаптировал SWC для космоса, но что-то пошло не так и на ракету они так никогда и не попали. Всего их было произведено 25 штук, одну из них недавно продали на аукционе за 45000 евро.',
        },
      ],
    },
    {
      date: '21 июня',
      messages: [
        {
          isMine: false,
          time: '11:56',
          message: 'Круто!',
        },
        {
          isMine: true,
          time: '12:00',
          isRead: false,
          message:
            'Привет! Смотри, тут всплыл интересный кусок лунной космической истории — НАСА в какой-то момент попросила Хассельблад адаптировать модель SWC для полетов на Луну. Сейчас мы все знаем что астронавты летали с моделью 500 EL — и к слову говоря, все тушки этих камер все еще находятся на поверхности Луны, так как астронавты с собой забрали только кассеты с пленкой. Хассельблад в итоге адаптировал SWC для космоса, но что-то пошло не так и на ракету они так никогда и не попали. Всего их было произведено 25 штук, одну из них недавно продали на аукционе за 45000 евро.',
        },
      ],
    },
  ],
};
